'''
Задание №4 «Output encoding»

Вам нужно сделать унифицированное преобразование выходных данных
(Output encoding)
'''

first_name = input('Please enter your first name: ')
last_name = input('Please enter your last name: ')
print('Your data:', first_name.capitalize(), last_name.capitalize())