/*
Задание 2 (тайминг 10 минут)
1.Реализуем метод добавления новых элементов в начало списка и удаление
первого элемента связного списка.
2.Односвязный список всегда имеет ссылку на первый элемент
последовательности, потому именно с реализации методов для первого
элемента последовательности стоит начать
 */

//
//class List {
//    Node head;
//
//    class Node {
//        int value;
//        Node next;
//    }
//    public void pushFront(int value) {
//        Node node = new Node();
//        node.value = value;
//        node.next = head;
//        head = node;
//    }
//
//    public void popFront() {
//        if(head != null){
//            head = head.next;
//        }
//    }
//
//    public void print(){
//        Node cur = head;
//        while (cur != null){
//            System.out.printf("%d ", cur.value);
//            cur = cur.next;
//        }
//        System.out.println();
//    }
//
//}



public class task_02 {
    public static void main(String[] args) {
//        List list = new List();
//        for (int i = 1; i <= 5; i++) {
//            list.pushFront(i);
//        }
//        list.print();
//
//        list.popFront();
//        list.popFront();
//
//        list.print();
    }
}
