/*
Хеш-таблица

Хеш-таблицей называется структура данных, представляющая собой
ассоциативный массив использующий хеш-функцию для выполнения операций
добавления, удаления и поиска элементов. В свою очередь ассоциативным
массивом называют структуру данных, которая хранит пары ключ – значение, где
ключ каждой пары является уникальным в пределах всего массива данных.

Важной особенностью хеш-таблиц является, при некотором разумном допущении,
получить сложность каждой из перечисленных операций равной O(1). Благодаря
этому свойству использование хеш-таблиц позволяет очень быстро и эффективно
работать с большими массивами данных и не терять скорости доступа к ним по
мере роста объема.

хеш-функцией называется специальный алгоритм, позволяющий
преобразовать входные данные произвольного размера и состава в битовую
строку фиксированной длины.

 */

public class task_04 {
}
